[
    {
      "bookId": 1,
      "bookName": "The Qur'an",
      "author": "Various",
      "image": "https://i.pinimg.com/originals/51/22/8e/51228e7dcf06cc491c89a525ec102f71.jpg",
      "review": "The Qur'an, the holy book of Islam, is a divine scripture believed by Muslims to be the word of God as revealed to Prophet Muhammad (peace be upon him) over a period of 23 years. It serves as a comprehensive guide for Muslims, providing guidance on various aspects of life including spirituality, morality, law, and social conduct. The Qur'an's profound teachings encompass themes of faith, worship, compassion, justice, and mercy. Its timeless wisdom continues to inspire millions worldwide, fostering spiritual growth and deepening understanding of Islam's principles and values.",
      "totalPages": 604,
      "rating": 5,
      "category": "Religious",
      "tags": ["Islamic", "Spirituality"],
      "publisher": "Various",
      "yearOfPublishing": 609,
      "relatedBooks": ["The Sealed Nectar", "The Fundamentals of Tawheed"]
    },
    {
      "bookId": 2,
      "bookName": "Muhammad: His Life Based on the Earliest Sources",
      "author": "Martin Lings",
      "image": "https://www.riwayat.my/image/taliastaib/image/cache/data/all_product_images/product-518/MUHAMMADHIS-1181x1181.png",
      "review": "Martin Lings provides a captivating portrayal of the life of Prophet Muhammad (peace be upon him), drawing from the earliest Islamic sources and historical accounts. Through meticulous research and insightful analysis, Lings presents a comprehensive biography that explores the Prophet's childhood, prophethood, teachings, struggles, and achievements. The narrative vividly depicts Muhammad's character, emphasizing his exemplary conduct, compassion, wisdom, and devotion to God. This book serves as an invaluable resource for understanding Islam's founding figure and his profound impact on history, spirituality, and civilization.",
      "totalPages": 384,
      "rating": 4.8,
      "category": "Biography",
      "tags": ["Islamic History", "Biography"],
      "publisher": "Inner Traditions",
      "yearOfPublishing": 1983,
      "relatedBooks": ["The Road to Mecca", "In the Footsteps of the Prophet"]
    },
    {
      "bookId": 3,
      "bookName": "The Road to Mecca",
      "author": "Muhammad Asad",
      "image": "https://m.media-amazon.com/images/I/31UlI0ectTL.jpg",
      "review": "Muhammad Asad's autobiographical masterpiece recounts his transformative journey from a secular Jewish upbringing in Austria to embracing Islam and becoming one of the most influential Muslim thinkers of the 20th century. Through vivid prose and profound reflections, Asad narrates his spiritual quest, encounters with various cultures and religions, and eventual discovery of Islam's universal truths. The book offers profound insights into the nature of faith, identity, and the human condition, inspiring readers to embark on their own journeys of self-discovery and spiritual growth.",
      "totalPages": 320,
      "rating": 4.5,
      "category": "Autobiography",
      "tags": ["Conversion Story", "Spiritual Journey"],
      "publisher": "Dar al-Andalus",
      "yearOfPublishing": 1954,
      "relatedBooks": ["The Sealed Nectar", "The Islamic Enlightenment"]
    },
    {
      "bookId": 4,
      "bookName": "The Sealed Nectar: Biography of the Noble Prophet",
      "author": "Safiur Rahman al-Mubarakpuri",
      "image": "https://darussalam.pk/images/detailed/31/the_sealed_necar_pk.jpg",
      "review": "Safiur Rahman al-Mubarakpuri's comprehensive biography offers a detailed account of the life of Prophet Muhammad (peace be upon him), meticulously researched and authentically narrated from Islamic sources. The book delves into the Prophet's lineage, early life, prophethood, struggles, triumphs, and legacy, providing readers with profound insights into his character, teachings, and mission. Through engaging storytelling and scholarly analysis, al-Mubarakpuri brings to life the extraordinary journey of Islam's final messenger, illuminating his timeless message of compassion, justice, and devotion to God.",
      "totalPages": 590,
      "rating": 4.7,
      "category": "Biography",
      "tags": ["Islamic History", "Biography"],
      "publisher": "Darussalam",
      "yearOfPublishing": 1979,
      "relatedBooks": ["Muhammad: His Life Based on the Earliest Sources", "The Art of Reciting the Qur'an"]
    },
    {
      "bookId": 5,
      "bookName": "The Fundamentals of Tawheed",
      "author": "Abu Ameenah Bilal Philips",
      "image": "https://islamfuture.files.wordpress.com/2010/06/concise-commentary-on-the-book-of-tawhid.jpg?w=500&h=440",
      "review": "Abu Ameenah Bilal Philips elucidates the concept of Tawheed, the fundamental principle of Islamic monotheism, in this comprehensive study. Exploring the categories of Tawheed, the author examines the theological, philosophical, and practical dimensions of affirming the Oneness of God in belief and practice. Through clear explanations and textual references, Philips clarifies misconceptions, addresses common questions, and provides readers with a solid foundation in Islamic creed. This book is an essential resource for understanding the core tenet of Islam and deepening one's faith in the unity and sovereignty of Allah.",
      "totalPages": 250,
      "rating": 4.6,
      "category": "Islamic Theology",
      "tags": ["Tawheed", "Islamic Creed"],
      "publisher": "International Islamic Publishing House",
      "yearOfPublishing": 1996,
      "relatedBooks": ["The Qur'an", "The Art of Reciting the Qur'an"]
    },
    {
        "bookId": 6,
        "bookName": "In the Footsteps of the Prophet: Lessons from the Life of Muhammad",
        "author": "Tariq Ramadan",
        "image": "https://booksondemand.ma/cdn/shop/products/3_382c9ed4-f2ef-4087-9383-e42565c0a0d7.jpg?v=1680517950&width=990",
        "review": "Tariq Ramadan offers a compelling exploration of the life and teachings of Prophet Muhammad (peace be upon him) in this illuminating work. Drawing from historical sources and Islamic tradition, Ramadan presents key lessons and insights gleaned from the Prophet's exemplary conduct, ethics, and interactions. Through engaging narratives and practical reflections, readers are guided to emulate Muhammad's virtues and apply his teachings to contemporary challenges. This book serves as a valuable resource for Muslims seeking to deepen their understanding of the Prophet's legacy and embody his noble character in their daily lives.",
        "totalPages": 288,
        "rating": 4.4,
        "category": "Islamic Studies",
        "tags": ["Prophetic Tradition", "Ethics"],
        "publisher": "Oxford University Press",
        "yearOfPublishing": 2007,
        "relatedBooks": ["Muhammad: His Life Based on the Earliest Sources", "The Road to Mecca"]
    },
 
    {
      "bookId": 7,
      "bookName": "The Islamic Enlightenment: The Modern Struggle Between Faith and Reason",
      "author": "Christopher de Bellaigue",
      "image": "https://m.media-amazon.com/images/I/91If+6TsXFL._SY522_.jpg",
      "review": "Christopher de Bellaigue delves into the complex interplay between faith and reason in the Islamic world, tracing the intellectual currents that have shaped Muslim societies from the 19th century to the present day. Through meticulous research and nuanced analysis, de Bellaigue examines the challenges of reconciling traditional Islamic values with the forces of modernity, secularism, and globalization. He explores the contributions of Muslim thinkers, activists, and reformers who have sought to navigate this tension and promote intellectual revival and social progress within Islamic societies. With a balanced and insightful perspective, de Bellaigue sheds light on the ongoing dialogue between faith and reason in the Muslim world and its implications for the future of Islam and global civilization.",
      "totalPages": 416,
      "rating": 4.3,
      "category": "Islamic Studies",
      "tags": ["Enlightenment", "Islamic Thought"],
      "publisher": "Liveright",
      "yearOfPublishing": 2017,
      "relatedBooks": ["Islam: A Short History", "The Fundamentals of Tawheed"]
    },
    {
      "bookId": 8,
      "bookName": "Islam: A Short History",
      "author": "Karen Armstrong",
      "image": "https://m.media-amazon.com/images/I/811BD8pZZoL._SL1500_.jpg",
      "review": "Karen Armstrong provides a concise yet comprehensive overview of the history and development of Islam from its origins to the present day. Drawing on her expertise as a scholar of religion, Armstrong explores the key events, personalities, and movements that have shaped Islamic civilization, from the life of Prophet Muhammad (peace be upon him) to the spread of Islam across continents, the rise and fall of empires, and the diversity of Muslim cultures and societies. With clarity and insight, Armstrong illuminates the rich tapestry of Islamic history, offering readers a deeper understanding of the faith's origins, teachings, and global impact.",
      "totalPages": 256,
      "rating": 4.5,
      "category": "Islamic History",
      "tags": ["Historical Overview", "Civilization"],
      "publisher": "Modern Library",
      "yearOfPublishing": 2000,
      "relatedBooks": ["The Islamic Enlightenment", "In the Footsteps of the Prophet"]
    },
    {
      "bookId": 9,
      "bookName": "The Art of Reciting the Qur'an",
      "author": "Kristina Nelson",
      "image": "https://m.media-amazon.com/images/I/41DT9UD96eL.jpg",
      "review": "Kristina Nelson delves into the intricacies of Qur'anic recitation (Tajweed) in this insightful guide. Drawing on her expertise in Arabic linguistics and Islamic studies, Nelson provides readers with a comprehensive understanding of the rules, principles, and techniques of proper Qur'anic recitation. From mastering pronunciation and intonation to grasping the subtle nuances of Tajweed, this book offers practical advice, exercises, and examples to help learners enhance their recitation skills and deepen their spiritual connection with the Qur'an. Whether novice or experienced, readers will find this book to be an invaluable resource for improving their recitation and appreciation of the divine scripture.",
      "totalPages": 192,
      "rating": 4.7,
      "category": "Islamic Studies",
      "tags": ["Qur'anic Recitation", "Tajweed"],
      "publisher": "Dar al-Fikr",
      "yearOfPublishing": 2004,
      "relatedBooks": ["The Qur'an", "The Fundamentals of Tawheed"]
    }
  ]
  